cases/channel/0.org/Water.continuous
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Water.continuous;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type        uniformFixedValue;
        uniformValue table
        (
            (0      0.0)
            (0.5    0.1)
        );
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    walls
    {
        type        zeroGradient;
    }

    empties
    {
        type        empty;
    }
}
