cases/channel/0.org/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1E5;

boundaryField
{
    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        fixedValue;
        value       $internalField;
    }

    walls
    {
        type        zeroGradient;
    }

    empties
    {
        type        empty;
    }
}
