cases/channel/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

activeSpecies
(
    Water
    PG
    VG
);

inactiveSpecies
(
    Air
);

inertSpecie Air;

phaseMixing
{
    viscosity       continuousPhase;
    conductivity    continuousPhase;
    heatCapacity    continuousPhase;
}
